package testcase;
//我国古代数学家张丘建在《算经》一书中曾提出过著名的“百钱买百鸡”问题，
// 该问题叙述如下：鸡翁一，值钱五；鸡母一，值钱三；鸡雏三，值钱一；百钱买百鸡，则翁、母、雏各几何？
// 意思是公鸡一只五文钱，母鸡一只三文钱，小鸡三只一文钱，现在要用一百文钱买一百只鸡,一百只鸡必须有公鸡、母鸡和小鸡
// 问公鸡、母鸡、小鸡各多少只？输出所有可能的组合。

public class Test6 {
    public static void main(String[] args) {
        for (int i = 1; i < 20; i++) {//定义公鸡初始值为1，每次循环加一只，最多19只
            for (int j = 1; j < (100-5-1) / 3; j++) {//定义母鸡初始值为1，每次循环加一只，最多100/3只
                for (int k = 3; k < 100; k++) {//定义小鸡初始值为1，每次循环加一只，最多100只
                    if (i * 5 + j * 3 + k / 3 == 100 && k % 3 == 0 && i + j + k == 100) {//判断鸡的价值总额等于100并且总数也是100而且小鸡的数量需要是3的倍数，不然钱花不完
                        System.out.printf("公鸡：%s,母鸡：%s,小鸡:%s", i, j, k);//输出公鸡母鸡小鸡的个数
                        System.out.println();//换行
                    }
                }
            }
        }
    }
}